In [150]:
import pandas as pd
from pathlib import Path

In [151]:
# Uploading CSV files from the location
aapl_upload = Path("C:\\Users\\vinot\\Fintech_Homeworks\\HW03_Pandas\\aapl_historical.csv")
algo_upload = Path("C:\\Users\\vinot\\Fintech_Homeworks\\HW03_Pandas\\algo_returns.csv")
cost_upload = Path("C:\\Users\\vinot\\Fintech_Homeworks\\HW03_Pandas\\cost_historical.csv")
goog_upload = Path("C:\\Users\\vinot\\Fintech_Homeworks\\HW03_Pandas\\goog_historical.csv")
sp500_upload=Path("C:\\Users\\vinot\\Fintech_Homeworks\\HW03_Pandas\\sp500_history.csv")
whale_upload=Path("C:\\Users\\vinot\\Fintech_Homeworks\\HW03_Pandas\\whale_returns.csv")

In [152]:
#Reading the uploaded CSV files
appl_data=pd.read_csv(aapl_upload,index_col="Trade DATE",parse_dates=True,infer_datetime_format=True)
algo_data=pd.read_csv(algo_upload,index_col="Date",parse_dates=True,infer_datetime_format=True)
cost_data=pd.read_csv(cost_upload,index_col="Trade DATE",parse_dates=True,infer_datetime_format=True)
goog_data=pd.read_csv(goog_upload,index_col="Trade DATE",parse_dates=True,infer_datetime_format=True)
whale_data=pd.read_csv(whale_upload,index_col="Date",parse_dates=True,infer_datetime_format=True)
sp500_data=pd.read_csv(sp500_upload,index_col="Date",parse_dates=True,infer_datetime_format=True)

In [153]:
#Sampling head data in appl_historical data
appl_data.head()

           Symbol    NOCP
Trade DATE
2019-05-09   AAPL  200.72
2019-05-08   AAPL  202.90
2019-05-07   AAPL  202.86
2019-05-06   AAPL  208.48
2019-05-03   AAPL  211.75

In [154]:
#Sampling header details from historical cost data
cost_data.head()

           Symbol    NOCP
Trade DATE
2019-05-09   COST  243.47
2019-05-08   COST  241.34
2019-05-07   COST  240.18
2019-05-06   COST  244.23
2019-05-03   COST  244.62

In [155]:
#sampling header data from goog_data
goog_data.head()

           Symbol     NOCP
Trade DATE
2019-05-09   GOOG  1162.38
2019-05-08   GOOG  1166.27
2019-05-07   GOOG  1174.10
2019-05-06   GOOG  1189.39
2019-05-03   GOOG  1185.40

In [156]:
#sampling header data from whale returns
whale_data.head()

,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
Date,,,,
2015-03-02,NaN,NaN,NaN,NaN
2015-03-03,-0.001266,-0.004981,-0.000496,-0.006569
2015-03-04,0.002230,0.003241,-0.002534,0.004213
2015-03-05,0.004016,0.004076,0.002355,0.006726
2015-03-06,-0.007905,-0.003574,-0.008481,-0.013098

In [157]:
whale_data.isnull()

,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
Date,,,,
2015-03-02,True,True,True,True
2015-03-03,False,False,False,False
2015-03-04,False,False,False,False
2015-03-05,False,False,False,False
2015-03-06,False,False,False,False
...,...,...,...,...
2019-04-25,False,False,False,False
2019-04-26,False,False,False,False
2019-04-29,False,False,False,False
2019-04-30,False,False,False,False
2019-05-01,False,False,False,False

In [158]:
#Check for the Null values & count Null values
whale_data.isnull().sum()

SOROS FUND MANAGEMENT LLC      1
PAULSON & CO.INC.              1
TIGER GLOBAL MANAGEMENT LLC    1
BERKSHIRE HATHAWAY INC         1
dtype: int64

In [159]:
#Drop the Null values in Whale_Data
whale_data.dropna(inplace=True)
whale_data.isnull().sum()

SOROS FUND MANAGEMENT LLC      0
PAULSON & CO.INC.              0
TIGER GLOBAL MANAGEMENT LLC    0
BERKSHIRE HATHAWAY INC         0
dtype: int64

In [160]:
#Check for the Null values & count Null values
algo_data.isnull().sum()

Algo 1    0
Algo 2    6
dtype: int64

In [161]:
#Drop the Null values in algo_returns
algo_data.dropna(inplace=True)
algo_data.isnull().sum()

Algo 1    0
Algo 2    0
dtype: int64

In [162]:
#sampling header data from sp500
sp500_data.isnull().sum()

Close    0
dtype: int64

In [163]:
#check the data types in sp500
sp500_data.dtypes

Close    object
dtype: object

In [164]:
sp500_data.head()

               Close
Date
2019-04-23  $2933.68
2019-04-22  $2907.97
2019-04-18  $2905.03
2019-04-17  $2900.45
2019-04-16  $2907.06

In [165]:
sp500_data['Close'] = sp500_data['Close'].str.replace(r'\D', '').astype('float64')
#sp_500_upd = sp500_data["Close"].str.split("$",expand=False)

In [166]:
sp500_data.head()

               Close
Date
2019-04-23  293368.0
2019-04-22  290797.0
2019-04-18  290503.0
2019-04-17  290045.0
2019-04-16  290706.0

In [167]:
sp500_data.dtypes

Close    float64
dtype: object